BAS BMEKZU Project/src/Enums/ВидыСправокОДоходах/ВидыСправокОДоходах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСправокОДоходах</name>
  <enumValues>
    <name>Произвольная</name>
  </enumValues>
  <enumValues>
    <name>Пенсия2015</name>
  </enumValues>
  <enumValues>
    <name>Соцстрах</name>
  </enumValues>
  <enumValues>
    <name>Безработица</name>
  </enumValues>
  <enumValues>
    <name>Пенсия</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДоходыИНалоги</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСоцстрах2015</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСубсидия2015</name>
  </enumValues>
  <enumValues>
    <name>Субсидия</name>
  </enumValues>
  <enumValues>
    <name>Соцстрах2015</name>
  </enumValues>
  <enumValues>
    <name>Субсидия2015</name>
  </enumValues>
  <enumValues>
    <name>ДоходыИНалоги</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ВидыСправокОДоходах/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Отбор) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Произвольная"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Пенсия2015"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Соцстрах"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Безработица"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Пенсия"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Субсидия"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Соцстрах2015"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Соцстрах2023"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Субсидия2015"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.ДоходыИНалоги"));
		
	КонецЕсли;     
	
КонецПроцедуры

#КонецОбласти
